Catalogs/СтепениРодстваФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>СтепениРодстваФизическихЛиц</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
	</Catalog>
</MetaDataObject>

Enums/ПолФизическогоЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ПолФизическогоЛица</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Мужской</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Женский</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/СтепениРодстваФизическихЛиц/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// ТехнологияСервиса.ВыгрузкаЗагрузкаДанных

// Возвращает реквизиты справочника, которые образуют естественный ключ для элементов справочника.
//
// Возвращаемое значение:
//  Массив из Строка - имена реквизитов, образующих естественный ключ.
//
Функция ПоляЕстественногоКлюча() Экспорт
	
	Результат = Новый Массив;
	
	Результат.Добавить("Код");
	
	Возврат Результат;
	
КонецФункции

// Конец ТехнологияСервиса.ВыгрузкаЗагрузкаДанных

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура выполняет первоначальное заполнение классификатора.
Процедура НачальноеЗаполнение() Экспорт
	КлассификаторТаблица = ТаблицаНачальногоЗаполнения();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СтепениРодстваФизическихЛиц.Наименование
	               |ИЗ
	               |	Справочник.СтепениРодстваФизическихЛиц КАК СтепениРодстваФизическихЛиц";
	
	ТаблицаСуществующих = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаКлассификатора Из КлассификаторТаблица Цикл
		Если ТаблицаСуществующих.Найти(СтрокаКлассификатора.Наименование,"Наименование")  = Неопределено Тогда
			СправочникОбъект = Справочники.СтепениРодстваФизическихЛиц.СоздатьЭлемент();
			ЗаполнитьЗначенияСвойств(СправочникОбъект, СтрокаКлассификатора);
			СправочникОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
			СправочникОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ТаблицаНачальногоЗаполнения() Экспорт
	ОМ = Метаданные.Справочники.СтепениРодстваФизическихЛиц;
	ТаблицаЗначений = Новый ТаблицаЗначений;
	ТаблицаЗначений.Колонки.Добавить("Код",          ОбщегоНазначения.ОписаниеТипаСтрока(ОМ.ДлинаКода));
	ТаблицаЗначений.Колонки.Добавить("Наименование", ОбщегоНазначения.ОписаниеТипаСтрока(ОМ.ДлинаНаименования));
	ТаблицаЗначений.Колонки.Добавить("Пол",          Новый ОписаниеТипов("ПеречислениеСсылка.ПолФизическогоЛица"));
	
	СтрокаТаблицы = ТаблицаЗначений.Добавить();
	СтрокаТаблицы.Код = "01";
	СтрокаТаблицы.Пол = Перечисления.ПолФизическогоЛица.Мужской;
	СтрокаТаблицы.Наименование = НСтр("ru='Муж'");
	
	СтрокаТаблицы = ТаблицаЗначений.Добавить();
	СтрокаТаблицы.Код = "02";
	СтрокаТаблицы.Пол = Перечисления.ПолФизическогоЛица.Женский;
	СтрокаТаблицы.Наименование = НСтр("ru='Жена'");
	
	СтрокаТаблицы = ТаблицаЗначений.Добавить();
	СтрокаТаблицы.Код = "03";
	СтрокаТаблицы.Пол = Перечисления.ПолФизическогоЛица.Мужской;
	СтрокаТаблицы.Наименование = НСтр("ru='Отец'");
	
	СтрокаТаблицы = ТаблицаЗначений.Добавить();
	СтрокаТаблицы.Код = "04";
	СтрокаТаблицы.Пол = Перечисления.ПолФизическогоЛица.Женский;
	СтрокаТаблицы.Наименование = НСтр("ru='Мать'");
	
	СтрокаТаблицы = ТаблицаЗначений.Добавить();
	СтрокаТаблицы.Код = "05";
	СтрокаТаблицы.Пол = Перечисления.ПолФизическогоЛица.Мужской;
	СтрокаТаблицы.Наименование = НСтр("ru='Сын'");
	
	СтрокаТаблицы = ТаблицаЗначений.Добавить();
	СтрокаТаблицы.Код = "06";
	СтрокаТаблицы.Пол = Перечисления.ПолФизическогоЛица.Женский;
	СтрокаТаблицы.Наименование = НСтр("ru='Дочь'");
	
	СтрокаТаблицы = ТаблицаЗначений.Добавить();
	СтрокаТаблицы.Код = "07";
	СтрокаТаблицы.Пол = Перечисления.ПолФизическогоЛица.Мужской;
	СтрокаТаблицы.Наименование = НСтр("ru='Дедушка'");
	
	СтрокаТаблицы = ТаблицаЗначений.Добавить();
	СтрокаТаблицы.Код = "08";
	СтрокаТаблицы.Пол = Перечисления.ПолФизическогоЛица.Женский;
	СтрокаТаблицы.Наименование = НСтр("ru='Бабушка'");
	
	СтрокаТаблицы = ТаблицаЗначений.Добавить();
	СтрокаТаблицы.Код = "09";
	СтрокаТаблицы.Пол = Перечисления.ПолФизическогоЛица.Мужской;
	СтрокаТаблицы.Наименование = НСтр("ru='Внук'");
	
	СтрокаТаблицы = ТаблицаЗначений.Добавить();
	СтрокаТаблицы.Код = "10";
	СтрокаТаблицы.Пол = Перечисления.ПолФизическогоЛица.Женский;
	СтрокаТаблицы.Наименование = НСтр("ru='Внучка'");
	
	СтрокаТаблицы = ТаблицаЗначений.Добавить();
	СтрокаТаблицы.Код = "20";
	СтрокаТаблицы.Пол = Перечисления.ПолФизическогоЛица.Мужской;
	СтрокаТаблицы.Наименование = НСтр("ru='Брат'");
	
	СтрокаТаблицы = ТаблицаЗначений.Добавить();
	СтрокаТаблицы.Код = "21";
	СтрокаТаблицы.Пол = Перечисления.ПолФизическогоЛица.Женский;
	СтрокаТаблицы.Наименование = НСтр("ru='Сестра'");
	
	СтрокаТаблицы = ТаблицаЗначений.Добавить();
	СтрокаТаблицы.Код = "40";
	СтрокаТаблицы.Пол = Перечисления.ПолФизическогоЛица.Мужской;
	СтрокаТаблицы.Наименование = НСтр("ru='Отчим'");
	
	СтрокаТаблицы = ТаблицаЗначений.Добавить();
	СтрокаТаблицы.Код = "41";
	СтрокаТаблицы.Пол = Перечисления.ПолФизическогоЛица.Женский;
	СтрокаТаблицы.Наименование = НСтр("ru='Мачеха'");
	
	СтрокаТаблицы = ТаблицаЗначений.Добавить();
	СтрокаТаблицы.Код = "42";
	СтрокаТаблицы.Пол = Перечисления.ПолФизическогоЛица.Мужской;
	СтрокаТаблицы.Наименование = НСтр("ru='Пасынок'");
	
	СтрокаТаблицы = ТаблицаЗначений.Добавить();
	СтрокаТаблицы.Код = "43";
	СтрокаТаблицы.Пол = Перечисления.ПолФизическогоЛица.Женский;
	СтрокаТаблицы.Наименование = НСтр("ru='Падчерица'");
	
	СтрокаТаблицы = ТаблицаЗначений.Добавить();
	СтрокаТаблицы.Код = "50";
	СтрокаТаблицы.Пол = Перечисления.ПолФизическогоЛица.Мужской;
	СтрокаТаблицы.Наименование = НСтр("ru='Тесть'");
	
	СтрокаТаблицы = ТаблицаЗначений.Добавить();
	СтрокаТаблицы.Код = "51";
	СтрокаТаблицы.Пол = Перечисления.ПолФизическогоЛица.Женский;
	СтрокаТаблицы.Наименование = НСтр("ru='Теща'");
	
	СтрокаТаблицы = ТаблицаЗначений.Добавить();
	СтрокаТаблицы.Код = "52";
	СтрокаТаблицы.Пол = Перечисления.ПолФизическогоЛица.Мужской;
	СтрокаТаблицы.Наименование = НСтр("ru='Свекор'");
	
	СтрокаТаблицы = ТаблицаЗначений.Добавить();
	СтрокаТаблицы.Код = "53";
	СтрокаТаблицы.Пол = Перечисления.ПолФизическогоЛица.Женский;
	СтрокаТаблицы.Наименование = НСтр("ru='Свекровь'");
	
	СтрокаТаблицы = ТаблицаЗначений.Добавить();
	СтрокаТаблицы.Код = "54";
	СтрокаТаблицы.Пол = Перечисления.ПолФизическогоЛица.Мужской;
	СтрокаТаблицы.Наименование = НСтр("ru='Зять'");
	
	СтрокаТаблицы = ТаблицаЗначений.Добавить();
	СтрокаТаблицы.Код = "55";
	СтрокаТаблицы.Пол = Перечисления.ПолФизическогоЛица.Женский;
	СтрокаТаблицы.Наименование = НСтр("ru='Невестка (сноха)'");
	
	СтрокаТаблицы = ТаблицаЗначений.Добавить();
	СтрокаТаблицы.Код = "70";
	СтрокаТаблицы.Пол = Перечисления.ПолФизическогоЛица.ПустаяСсылка();
	СтрокаТаблицы.Наименование = НСтр("ru='Другая степень родства'");
	
	Возврат ТаблицаЗначений;
КонецФункции

#КонецОбласти

#КонецЕсли
